WELCOME_MESSAGE = "👋 Привет, напиши свою группу (Пример: ИУ6-11Б)"

GROUP_NOT_EXISTS = "❌ Такой группы не существует!"

GROUP_SAVED = """✅ Группа успешно сохранена
🗓️ Попробуй /week (расписание на неделю)
🚪 Используй /share, чтобы другие видели, когда у тебя закончатся пары"""

SHARE_STATUS = ["✅ Вы больше не делитесь расписанием", "✅ Вы начали делиться расписанием"]

SCHEDULE_BUTTONS = "🔢 Выберите промежуток расписания"

USER_FREE_NOW = "[{name}](tg://user?id={user_id}) сейчас свободен"

USER_BUSY_NOW = "У [{name}](tg://user?id={user_id}) сейчас {class_now}/{class_len} пара \\(закончит в {end_time}\\)"
