WELCOME_MESSAGE = "👋 Привет, напиши свою группу (Пример: ИУ6-11Б)"

GROUP_NOT_EXISTS = "❌ Такой группы не существует!"

GROUP_SAVED = """✅ Группа успешно сохранена
🗓️ Попробуй /week (расписание на неделю)
🚪 Используй /share, чтобы другие видели, когда у тебя закончатся пары"""

SHARE_STATUS = ["✅ Вы больше не делитесь расписанием", "✅ Вы начали делиться расписанием"]

SCHEDULE_BUTTONS = "🔢 Выберите промежуток расписания"

NOTIFICATIONS_SETTINGS = "⚙️ Используйте кнопки для настройки уведомлений"

MAIN_SETTINGS = "⚙️ Используйте кнопки для настройки бота"

USER_FREE_NOW = "[{name}](tg://user?id={user_id}) сейчас свободен"

USER_BUSY_NOW = "У [{name}](tg://user?id={user_id}) сейчас {class_now}/{class_len} пара \\(закончит в {end_time}\\)"

EVERYDAY_SUB_START = "🔔 Подписка на уведомления: Ежедневное расписание\n\n"

AFTERCLS_SUB_START = "🔔 Подписка на уведомления: Свободные студенты\n\n"

NO_FREE_USERS = "😩 Все пользователи сейчас заняты"

WELCOME_CHAT = """👋 Теперь бот сможет показывать кто из участников чата свободен
❗️ Бот видит только людей, которые выбрали свою группу
✒️ Используйте /group или напишите боту в личные сообщения
🗓️ Пример: /group ИУ6-11Б"""

BAD_GROUP_CMD = """❌ Укажите группу
🗓️ Пример использования команды: /group ИУ6-11Б"""

CHAT_GROUP_SAVED = """✅ Группа успешно сохранена
📝 Используйте /chat_free чтобы посмотреть свободных участников чата"""
